[net]
batch=64
subdivisions=8
width=512
height=512
channels=3
momentum=0.949
decay=0.0005
angle=0
saturation=1.5
exposure=1.5
hue=.1
learning_rate=0.00261
burn_in=1000
max_batches=500500
policy=steps
steps=400000,450000
scales=.1,.1
mosaic=1

[convolutional]
batch_normalize=1
filters=9
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=17
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=9
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=17
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=35
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=17
size=1
stride=1
pad=1
activation=leaky

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=17
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=17
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=17
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=17
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=17
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=18
size=1
stride=1
pad=1
activation=leaky

[route]
layers=-1,-10

[convolutional]
batch_normalize=1
filters=34
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=67
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=34
size=1
stride=1
pad=1
activation=leaky

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=33
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=35
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=33
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=33
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=33
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=35
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=33
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=34
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=33
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=35
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=33
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=34
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=33
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=33
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=33
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=33
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=33
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=33
size=1
stride=1
pad=1
activation=leaky

[route]
layers=-1,-28

[convolutional]
batch_normalize=1
filters=67
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=136
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=67
size=1
stride=1
pad=1
activation=leaky

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=69
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=66
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=69
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=67
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=69
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=68
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=69
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=67
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=69
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=66
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=69
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=68
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=69
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=67
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=69
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=67
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=69
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=69
size=1
stride=1
pad=1
activation=leaky

[route]
layers=-1,-28

[convolutional]
batch_normalize=1
filters=135
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=264
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=136
size=1
stride=1
pad=1
activation=leaky

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=130
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=134
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=130
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=130
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=130
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=133
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=130
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=130
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=130
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=133
size=1
stride=1
pad=1
activation=leaky

[route]
layers=-1,-16

[convolutional]
batch_normalize=1
filters=272
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=136
size=1
stride=1
pad=1
activation=leaky

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=135
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=130
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[maxpool]
stride=1
size=5

[route]
layers=-2

[maxpool]
stride=1
size=9

[route]
layers=-4

[maxpool]
stride=1
size=13

[route]
layers=-1,-3,-5,-6

[convolutional]
batch_normalize=1
filters=132
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=135
activation=leaky

[route]
layers=-1,-13

[convolutional]
batch_normalize=1
filters=135
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=79

[convolutional]
batch_normalize=1
filters=69
size=1
stride=1
pad=1
activation=leaky

[route]
layers=-1,-3

[convolutional]
batch_normalize=1
filters=67
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=68
size=1
stride=1
pad=1
activation=leaky

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=67
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=69
activation=leaky

[convolutional]
batch_normalize=1
filters=67
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=66
activation=leaky

[route]
layers=-1,-6

[convolutional]
batch_normalize=1
filters=69
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=48

[convolutional]
batch_normalize=1
filters=33
size=1
stride=1
pad=1
activation=leaky

[route]
layers=-1,-3

[convolutional]
batch_normalize=1
filters=34
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=33
size=1
stride=1
pad=1
activation=leaky

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=35
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=34
activation=leaky

[convolutional]
batch_normalize=1
filters=33
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=34
activation=leaky

[route]
layers=-1,-6

[convolutional]
batch_normalize=1
filters=33
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=69
activation=leaky

[route]
layers=-1,127

[convolutional]
batch_normalize=1
filters=66
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=67
size=1
stride=1
pad=1
activation=leaky

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=66
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=65
activation=leaky

[convolutional]
batch_normalize=1
filters=68
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=68
activation=leaky

[route]
layers=-1,-6

[convolutional]
batch_normalize=1
filters=70
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=129
activation=leaky

[route]
layers=-1,113

[convolutional]
batch_normalize=1
filters=132
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=138
size=1
stride=1
pad=1
activation=leaky

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=132
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=138
activation=leaky

[convolutional]
batch_normalize=1
filters=132
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=139
activation=leaky

[route]
layers=-1,-6

[convolutional]
batch_normalize=1
filters=129
size=1
stride=1
pad=1
activation=leaky

[route]
layers=141

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=66
activation=leaky

[convolutional]
batch_normalize=0
size=1
stride=1
pad=1
filters=24
activation=linear

[yolo]
mask=0,1,2
anchors=12, 16, 19, 36, 40, 28, 36, 75, 76, 55, 72, 146, 142, 110, 192, 243, 459, 401
classes=3
num=9
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1
scale_x_y=1.05
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6

[route]
layers=152

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=134
activation=leaky

[convolutional]
batch_normalize=0
size=1
stride=1
pad=1
filters=24
activation=linear

[yolo]
mask=3,4,5
anchors=12, 16, 19, 36, 40, 28, 36, 75, 76, 55, 72, 146, 142, 110, 192, 243, 459, 401
classes=3
num=9
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1
scale_x_y=1.05
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6

[route]
layers=163

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=273
activation=leaky

[convolutional]
batch_normalize=0
size=1
stride=1
pad=1
filters=24
activation=linear

[yolo]
mask=6,7,8
anchors=12, 16, 19, 36, 40, 28, 36, 75, 76, 55, 72, 146, 142, 110, 192, 243, 459, 401
classes=3
num=9
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1
scale_x_y=1.05
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6

